# Week 8 Pandas Advance Assignment

## Q1. List any five functions of the pandas library with execution.

The Five Function of Pandas library are :

### 1.`pandas.DataFrame()` : 
It is used to create a dataframe.

In [1]:
import pandas as pd
df = pd.DataFrame({
    'Name' : ['Maninder','Vikrant','Aman'],
    'Age' : [20,19,18]})
df

       Name  Age
0  Maninder   20
1   Vikrant   19
2      Aman   18

### 2.`pandas.Series()` : 
It is used to create a series in pandas

In [3]:
pd.Series([3,4,5,6])

0    3
1    4
2    5
3    6
dtype: int64

### 3.`pandas.read_csv()` : 
It is used to read csv file either from local storage or from any url

In [7]:
df1 = pd.read_csv("https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv")
df1.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

### 4.`pandas.concat()`:
It is used to concatinate two or more dataframes.

In [13]:
data1 = {'A': [1, 2, 3], 'B': [4, 5, 6]}
data2 = {'A': [7, 8, 9], 'B': [10, 11, 12]}

df1 = pd.DataFrame(data1)
df2 = pd.DataFrame(data2)

pd.concat([df1,df2],axis = 1)

   A  B  A   B
0  1  4  7  10
1  2  5  8  11
2  3  6  9  12

### `pandas.DataFrame.drop()`: 
It is used to remove specific rows or columns from a DataFrame.

In [14]:
df = pd.DataFrame({
    'Name' : ['Maninder','Vikrant','Aman'],
    'Age' : [20,19,18]})
df

       Name  Age
0  Maninder   20
1   Vikrant   19
2      Aman   18

In [16]:
df.drop('Age',axis = 1)

       Name
0  Maninder
1   Vikrant
2      Aman

## Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [39]:
def reindex(df):
    df.reset_index(drop = True)
    df.index = df.index*2+1
    return df

df = pd.DataFrame({'A': [1, 2, 3], 'B': [4, 5, 6], 'C': [7, 8, 9]})
reindex(df)

   A  B  C
1  1  4  7
3  2  5  8
5  3  6  9

## Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The function should print the sum to the console.
## For example, if the 'Values' column of df contains the values [10, 20, 30, 40, 50], your function should calculate and print the sum of the first three values, which is 60.

In [7]:
def summ(df):
    added = 0
    for i in range(3):
        added+=df['Values'][i]
    return added

df = pd.DataFrame({'Values' : [10,20,30,40,50]})

result = summ(df)
result

60

# OR

In [8]:
def summ(df):
    return df['Values'][0:3].sum()

df = pd.DataFrame({'Values' : [10,20,30,40]})

result = summ(df)
result

60

## Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column 'Word_Count' that contains the number of words in each row of the 'Text' column.

In [15]:
def count_word(df):
    df['Word_Count'] = df['Text'].apply(lambda x : len(x.split()))
df = pd.DataFrame({'Text' : ['Ayooo','Guess who is back','nobody is back']})
count_word(df)
df

                Text  Word_Count
0              Ayooo           1
1  Guess who is back           4
2     nobody is back           3

## Q5. How are DataFrame.size() and DataFrame.shape() different?

### DataFrame.size()
DataFrame.Size() gives the total number of elements in DataFrame.

### DataFrame.shape()
It return the tuple containing the dimension of DataFrame.

In [16]:
df = pd.DataFrame({'Name' : ['Maninder','Virant','Aman','Shubham','Garvit','Gautam'],
                   'Age' : [20,19, 18 ,21,20,18],
                   'City' : ['Patiala','Panipat','Karnal','Brampton','Ontario','Rajpura']
}
)

In [23]:
df.size

18

In [24]:
df.shape

(6, 3)

## Q6. Which function of pandas do we use to read an excel file?

`pandas.read_excel()` function is used to read an excel file

## Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email addresses in the format 'username@domain.com'. Write a Python function that creates a new column 'Username' in df that contains only the username part of each email address.
### The username is the part of the email address that appears before the '@' symbol. For example, if the email address is 'john.doe@example.com', the 'Username' column should contain 'john.doe'. Your function should extract the username from each email address and store it in the new 'Username' column.

In [29]:
def user(df):
    df['Username'] = df['Email'].apply(lambda x:x.split('@')[0])

df = pd.DataFrame({'Email':['maninder@gmail.com','vikrant@hotmail.com','aman@protonmail.com','john.doe@example.com']})
user(df)
df

                  Email  Username
0    maninder@gmail.com  maninder
1   vikrant@hotmail.com   vikrant
2   aman@protonmail.com      aman
3  john.doe@example.com  john.doe

### Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The function should return a new DataFrame that contains only the selected rows. For example, if df contains the following values:

              A B C
            0 3 5 1
            1 8 2 7
            2 6 9 4
            3 2 3 5
            4 9 1 2


### Your function should select the following rows: 
          A B C
        1 8 2 7
        4 9 1 2
### The function should return a new DataFrame that contains only the selected rows.

In [52]:
def selection(df):
    df1 = df[(df['A']>5) & (df['B']<10)]
    return df1

df = pd.DataFrame({'A' : [3,8,6,2,9],
                   'B' : [5,2,9,3,1],
                   'C' : [1,7,4,5,2]})

df1=selection(df)
df1

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

## Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean, median, and standard deviation of the values in the 'Values' column.

In [55]:
def stats(df):
    mean = df['Values'].mean()
    med = df['Values'].median()
    st = df['Values'].std()
    print(f'mean = {mean} \nmedian = {med} \nstandard deviation = {st}')
df = pd.DataFrame({'Values':[10,20,30,40,50]})

stats(df)

mean = 30.0
median = 30.0
standard deviation = 15.811388300841896

## Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days for each row in the DataFrame. The moving average should be calculated using a window of size 7 and should include the current day.

In [28]:
def mov_avg(df):
    df['MovingAverage'] = df['Sales'].rolling(window = 7, min_periods = 1).mean()

df = pd.DataFrame({'Sales' : [10,20,30,40,50,60,70],
                   'Date' : pd.date_range(start = '2023-08-02',periods = 7)})
mov_avg(df)
df

   Sales       Date  MovingAverage
0     10 2023-08-02           10.0
1     20 2023-08-03           15.0
2     30 2023-08-04           20.0
3     40 2023-08-05           25.0
4     50 2023-08-06           30.0
5     60 2023-08-07           35.0
6     70 2023-08-08           40.0

## Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g. Monday, Tuesday) corresponding to each date in the 'Date' column.

### For example, if df contains the following values:
          Date
        0 2023-01-01
        1 2023-01-02
        2 2023-01-03
        3 2023-01-04
        4 2023-01-05
        
### Your function should create the following DataFrame:

            Date      Weekday
        0 2023-01-01  Sunday
        1 2023-01-02  Monday
        2 2023-01-03  Tuesday
        3 2023-01-04  Wednesday
        4 2023-01-05  Thursday
### The function should return the modified DataFrame.

In [76]:

def weekday(df,date):
    df['Weekday'] = df['Date'].dt.day_name()
    
    
date = pd.date_range(start = '2023-01-01', end = '2023-01-05')
df = pd.DataFrame({'Date' : dt})

weekday(df,date)
df

        Date    Weekday
0 2023-01-01     Sunday
1 2023-01-02     Monday
2 2023-01-03    Tuesday
3 2023-01-04  Wednesday
4 2023-01-05   Thursday

## Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python function to select all rows where the date is between '2023-01-01' and '2023-01-31'.

In [85]:
def select(df):
    df1 = df[(df['Date']>'2023-01-01') & (df['Date'] < '2023-01-31') ]
    return df1

df = pd.DataFrame({'Date' : pd.date_range(start = '2023-01-01', periods = 100)})

select(df)

         Date
1  2023-01-02
2  2023-01-03
3  2023-01-04
4  2023-01-05
5  2023-01-06
6  2023-01-07
7  2023-01-08
8  2023-01-09
9  2023-01-10
10 2023-01-11
11 2023-01-12
12 2023-01-13
13 2023-01-14
14 2023-01-15
15 2023-01-16
16 2023-01-17
17 2023-01-18
18 2023-01-19
19 2023-01-20
20 2023-01-21
21 2023-01-22
22 2023-01-23
23 2023-01-24
24 2023-01-25
25 2023-01-26
26 2023-01-27
27 2023-01-28
28 2023-01-29
29 2023-01-30

## Q13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to be imported?

pandas is first and foremost library that needs to be imported

In [88]:
import pandas as pd